products/admin/fedexwsdl/RateRequest_FXF_v13.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v13="http://fedex.com/ws/rate/v13">
   <soapenv:Header/>
   <soapenv:Body>
      <v13:RateRequest>
          <v13:WebAuthenticationDetail>
            <v13:UserCredential>
               <v13:Key></v13:Key>
               <v13:Password/>
            </v13:UserCredential>
         </v13:WebAuthenticationDetail>
         <v13:ClientDetail>
            <v13:AccountNumber></v13:AccountNumber>
            <v13:MeterNumber></v13:MeterNumber>
            <v13:IntegratorId>12345</v13:IntegratorId>
            <v13:Localization>
               <v13:LanguageCode>EN</v13:LanguageCode>
               <v13:LocaleCode>ES</v13:LocaleCode>
            </v13:Localization>
         </v13:ClientDetail>
         <v13:TransactionDetail>
            <v13:CustomerTransactionId>PROCESS SHIPMENT</v13:CustomerTransactionId>
            <v13:Localization>
               <v13:LanguageCode>EN</v13:LanguageCode>
               <v13:LocaleCode>ES</v13:LocaleCode>
            </v13:Localization>
         </v13:TransactionDetail>
         <v13:Version>
            <v13:ServiceId>crs</v13:ServiceId>
            <v13:Major>13</v13:Major>
            <v13:Intermediate>0</v13:Intermediate>
            <v13:Minor>0</v13:Minor>
         </v13:Version>
         <v13:RequestedShipment>
            <v13:ShipTimestamp>2011-06-15T12:12:28-06:00</v13:ShipTimestamp>
            <v13:DropoffType>REGULAR_PICKUP</v13:DropoffType>
            <v13:ServiceType>FEDEX_FREIGHT_PRIORITY</v13:ServiceType>
            <v13:PackagingType>YOUR_PACKAGING</v13:PackagingType>
            <v13:TotalWeight>
               <v13:Units>LB</v13:Units>
               <v13:Value>19999.0</v13:Value>
            </v13:TotalWeight>
            <v13:Shipper>
               <v13:AccountNumber>511943078</v13:AccountNumber>
               <v13:Tins>
                  <v13:TinType>PERSONAL_STATE</v13:TinType>
                  <v13:Number>1057</v13:Number>
                  <v13:Usage>ShipperTinsUsage</v13:Usage>
               </v13:Tins>
               <v13:Contact>
                  <v13:ContactId>RBB1057</v13:ContactId>
                  <v13:PersonName>ROHIT BORSE</v13:PersonName>
                  <v13:Title>Mr.</v13:Title>
                  <v13:CompanyName>DEOYAROHIT0705$</v13:CompanyName>
                  <v13:PhoneNumber>9762308621</v13:PhoneNumber>
                  <v13:PhoneExtension>02033469</v13:PhoneExtension>
                  <v13:PagerNumber>9762308621</v13:PagerNumber>
                  <v13:FaxNumber>9762308621</v13:FaxNumber>
                  <v13:EMailAddress>Rohit*Borse@DeoyaRohit.com</v13:EMailAddress>
               </v13:Contact>
               <v13:Address>
                  <v13:StreetLines>SHIPPER ADDRESS LINE 1</v13:StreetLines>
                  <v13:StreetLines>SHIPPER ADDRESS LINE 2</v13:StreetLines>
                  <v13:City>CHARLESTON</v13:City>
                  <v13:StateOrProvinceCode>WV</v13:StateOrProvinceCode>
                  <v13:PostalCode>25301-2522</v13:PostalCode>
                  <v13:UrbanizationCode>CO</v13:UrbanizationCode>
                  <v13:CountryCode>US</v13:CountryCode>
                  <v13:Residential>0</v13:Residential>
               </v13:Address>
            </v13:Shipper>
            <v13:Recipient>
               <v13:AccountNumber>554487670</v13:AccountNumber>
               <v13:Tins>
                  <v13:TinType>PERSONAL_STATE</v13:TinType>
                  <v13:Number>0705</v13:Number>
                  <v13:Usage>RecipientTinsUsage</v13:Usage>
               </v13:Tins>
               <v13:Contact>
                  <v13:ContactId>DRB0705</v13:ContactId>
                  <v13:PersonName>DEOYANEE BHADANE</v13:PersonName>
                  <v13:Title>Ms.</v13:Title>
                  <v13:CompanyName>DEOYAROHIT0705$</v13:CompanyName>
                  <v13:PhoneNumber>9762308621</v13:PhoneNumber>
                  <v13:PhoneExtension>02033469</v13:PhoneExtension>
                  <v13:PagerNumber>9762308621</v13:PagerNumber>
                  <v13:FaxNumber>9762308621</v13:FaxNumber>
                  <v13:EMailAddress>Deoyanee*Bhadane@DeoyaRohit.com</v13:EMailAddress>
               </v13:Contact>
               <v13:Address>
                  <v13:StreetLines>RECIPIENT ADDRESS LINE 1</v13:StreetLines>
                  <v13:StreetLines>RECIPIENT ADDRESS LINE 2</v13:StreetLines>
                  <v13:City>KANATA</v13:City>
                  <v13:StateOrProvinceCode>ON</v13:StateOrProvinceCode>
                  <v13:PostalCode>K2T1B9</v13:PostalCode>
                  <v13:UrbanizationCode>ON</v13:UrbanizationCode>
                  <v13:CountryCode>CA</v13:CountryCode>
                  <v13:Residential>0</v13:Residential>
               </v13:Address>
            </v13:Recipient>
            <v13:RecipientLocationNumber>DEN001</v13:RecipientLocationNumber>
            <v13:ShippingChargesPayment>
               <v13:PaymentType>SENDER</v13:PaymentType>
               <v13:Payor>
                  <v13:ResponsibleParty>
                     <v13:AccountNumber>511943078</v13:AccountNumber>
                     <v13:Tins>
                        <v13:TinType>BUSINESS_STATE</v13:TinType>
                        <v13:Number>123456</v13:Number>
                     </v13:Tins>
                  </v13:ResponsibleParty>
               </v13:Payor>
            </v13:ShippingChargesPayment>
            <v13:FreightShipmentDetail>
               <v13:FedExFreightAccountNumber>511943078</v13:FedExFreightAccountNumber>
               <v13:FedExFreightBillingContactAndAddress>
                  <v13:Contact>
                     <v13:ContactId>RBB1057</v13:ContactId>
                     <v13:PersonName>ROHIT BORSE</v13:PersonName>
                     <v13:Title>Mr.</v13:Title>
                     <v13:CompanyName>DEOYAROHIT0705$</v13:CompanyName>
                     <v13:PhoneNumber>9762308621</v13:PhoneNumber>
                     <v13:PhoneExtension>02033469</v13:PhoneExtension>
                     <v13:PagerNumber>9762308621</v13:PagerNumber>
                     <v13:FaxNumber>9762308621</v13:FaxNumber>
                     <v13:EMailAddress>Rohit*Borse@syntelinc.com</v13:EMailAddress>
                  </v13:Contact>
                  <v13:Address>
                     <v13:StreetLines>SHIPPER ADDRESS LINE 1</v13:StreetLines>
                     <v13:StreetLines>SHIPPER ADDRESS LINE 2</v13:StreetLines>
                     <v13:City>CHARLESTON</v13:City>
                     <v13:StateOrProvinceCode>WV</v13:StateOrProvinceCode>
                     <v13:PostalCode>25301-2522</v13:PostalCode>
                     <v13:UrbanizationCode>CO</v13:UrbanizationCode>
                     <v13:CountryCode>US</v13:CountryCode>
                     <v13:Residential>0</v13:Residential>
                  </v13:Address>
               </v13:FedExFreightBillingContactAndAddress>
               <v13:Role>SHIPPER</v13:Role>
               <v13:CollectTermsType>STANDARD</v13:CollectTermsType>
               <v13:DeclaredValuePerUnit>
                  <v13:Currency>USD</v13:Currency>
                  <v13:Amount>50.0</v13:Amount>
               </v13:DeclaredValuePerUnit>
               <v13:DeclaredValueUnits>15</v13:DeclaredValueUnits>
               <v13:LiabilityCoverageDetail>
                  <v13:CoverageType>NEW</v13:CoverageType>
                  <v13:CoverageAmount>
                     <v13:Currency>USD</v13:Currency>
                     <v13:Amount>50.0</v13:Amount>
                  </v13:CoverageAmount>
               </v13:LiabilityCoverageDetail>
               <v13:Coupons/>
               <v13:TotalHandlingUnits>15</v13:TotalHandlingUnits>
               <v13:ClientDiscountPercent>0</v13:ClientDiscountPercent>
               <v13:PalletWeight>
                  <v13:Units>LB</v13:Units>
                  <v13:Value>50.0</v13:Value>
               </v13:PalletWeight>
               <v13:ShipmentDimensions>
                  <v13:Length>180</v13:Length>
                  <v13:Width>93</v13:Width>
                  <v13:Height>106</v13:Height>
                  <v13:Units>IN</v13:Units>
               </v13:ShipmentDimensions>
               <v13:LineItems>
                  <v13:FreightClass>CLASS_050</v13:FreightClass>
                  <v13:Packaging>BAG</v13:Packaging>
                  <v13:Description>LineItemsDescription</v13:Description>
                  <v13:Weight>
                     <v13:Units>LB</v13:Units>
                     <v13:Value>19999</v13:Value>
                  </v13:Weight>
                  <v13:Dimensions>
                     <v13:Length>180</v13:Length>
                     <v13:Width>93</v13:Width>
                     <v13:Height>106</v13:Height>
                     <v13:Units>IN</v13:Units>
                  </v13:Dimensions>
                  <v13:Volume>
                     <v13:Units>CUBIC_FT</v13:Units>
                     <v13:Value>28.39104</v13:Value>
                  </v13:Volume>
               </v13:LineItems>
            </v13:FreightShipmentDetail>
            <v13:BlockInsightVisibility>1</v13:BlockInsightVisibility>
            <v13:RateRequestTypes>ACCOUNT</v13:RateRequestTypes>
            <v13:PackageCount>1</v13:PackageCount>
         </v13:RequestedShipment>
      </v13:RateRequest>
   </soapenv:Body>
</soapenv:Envelope>